src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/combustion/fireFoam/LES/oppositeBurningPanels/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

".*"
{
    type            lookup;
    emissivity      1.0;
}

"(region0_to.*)"
{
    type            opaqueDiffusive;
    wallAbsorptionEmissionModel
    {
        type    solidAbsorption;
    }
}


// ************************************************************************* //
